# TW1

## Pandas Series and DataFrame

- Practice Pandas Series and DataFrame with examples.

#### Write your full name.




#### Submission:

-Start a new Github repository for this course.

-Push the completed code to your Github repository.

## Part 0

Practice Pandas Series and DataFrame with the given examples.

In [1]:
import pandas as pd

In [2]:
alist = ['Mouse', 'Giraffe', 'Tiger', 'Dog', 'Hippopotamus', 'Moose', 'Bear']
animals = pd.Series(alist)
animals

0           Mouse
1         Giraffe
2           Tiger
3             Dog
4    Hippopotamus
5           Moose
6            Bear
dtype: object

In [3]:
animals[2]

'Tiger'

In [4]:
animals.iloc[2]

'Tiger'

In [5]:
animals.loc[2]

'Tiger'

In [6]:
s1 = pd.Series(alist, index=[0, 1, 2, 3, 4, 5, 6])
s1.iloc[5]

'Moose'

In [7]:
s1.loc[2]

'Tiger'

In [8]:
s2 = pd.Series(alist, index=['a', 'b', 'c', 'd', 'e', 'f', 'g'])
s2

a           Mouse
b         Giraffe
c           Tiger
d             Dog
e    Hippopotamus
f           Moose
g            Bear
dtype: object

In [9]:
s2['c']

'Tiger'

In [10]:
s2.iloc[2]

'Tiger'

In [11]:
names = ['Chris', 'Kevin', 'Bob', 'Vinod', 'Daniel', 'Fil', 'Stephanie']
owners = pd.Series(names)
owners

0        Chris
1        Kevin
2          Bob
3        Vinod
4       Daniel
5          Fil
6    Stephanie
dtype: object

In [12]:
frame = {'animals': animals, 'owners': owners}

df = pd.DataFrame(frame)

df

        animals     owners
0         Mouse      Chris
1       Giraffe      Kevin
2         Tiger        Bob
3           Dog      Vinod
4  Hippopotamus     Daniel
5         Moose        Fil
6          Bear  Stephanie

In [13]:
df.columns

Index(['animals', 'owners'], dtype='object')

In [14]:
df.index

RangeIndex(start=0, stop=7, step=1)

In [15]:
type(df['animals'])

pandas.core.series.Series

In [16]:
df.iloc[0]

animals    Mouse
owners     Chris
Name: 0, dtype: object

In [17]:
df.iloc[0][1]

/var/folders/x1/thdjnr_j387c8lp2pq11h23r0000gn/T/ipykernel_7010/4037899947.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][1]

'Chris'

In [18]:
df.owners

0        Chris
1        Kevin
2          Bob
3        Vinod
4       Daniel
5          Fil
6    Stephanie
Name: owners, dtype: object

In [19]:
df['owners']

0        Chris
1        Kevin
2          Bob
3        Vinod
4       Daniel
5          Fil
6    Stephanie
Name: owners, dtype: object

In [20]:
# copy an existing DataFrame to create a new dataFrame
copy_df = df.copy()
copy_df

        animals     owners
0         Mouse      Chris
1       Giraffe      Kevin
2         Tiger        Bob
3           Dog      Vinod
4  Hippopotamus     Daniel
5         Moose        Fil
6          Bear  Stephanie

In [21]:
# drop columns

df2 = df.drop(['owners'], axis = 1)

df2

        animals
0         Mouse
1       Giraffe
2         Tiger
3           Dog
4  Hippopotamus
5         Moose
6          Bear

In [22]:
# drop columns

df3 = df.drop(columns = ['owners'])

df3

        animals
0         Mouse
1       Giraffe
2         Tiger
3           Dog
4  Hippopotamus
5         Moose
6          Bear

In [23]:
# drop rows

df4 = df.drop([0,1])
df4

        animals     owners
2         Tiger        Bob
3           Dog      Vinod
4  Hippopotamus     Daniel
5         Moose        Fil
6          Bear  Stephanie

In [24]:
midx = pd.MultiIndex(levels=[['lama', 'cow', 'falcon'],
                             ['speed', 'weight']],
                     codes=[[0, 0, 1, 1, 2, 2],
                            [0, 1, 0, 1, 0, 1]])

midx

MultiIndex([(  'lama',  'speed'),
            (  'lama', 'weight'),
            (   'cow',  'speed'),
            (   'cow', 'weight'),
            ('falcon',  'speed'),
            ('falcon', 'weight')],
           )

In [25]:
df = pd.DataFrame(index=midx, columns=['big', 'small'],
                   data=[[45, 30], [200, 100], [30, 20], [250, 150], [320, 250],[1, 0.8]])

df

               big  small
lama   speed    45   30.0
       weight  200  100.0
cow    speed    30   20.0
       weight  250  150.0
falcon speed   320  250.0
       weight    1    0.8

In [26]:
df.drop(index='cow', columns='small')

               big
lama   speed    45
       weight  200
falcon speed   320
       weight    1

In [27]:
df.drop(index='weight', level=1)

              big  small
lama   speed   45   30.0
cow    speed   30   20.0
falcon speed  320  250.0

## Part 1 Task 1

Given the data below, implement each tasks.

<img src="img/df.png" style="height:200px">

(1) Create a DataFrame.

(2) Access the first row data and print it.

(3) Access the first column data (indexed by 'dept') and print it.

(4) Create a new DataFrame by dropping the 2nd column data (indexed by 'floor') from the current DataFrame.

In [7]:
import pandas as pd
alist = ['CS', 'Bio', 'Chem', 'Phy', 'Eng']

dept = pd.Series(alist)

blist =['5', '3', '3', '2', '4']
floor = pd.Series(blist)


frame = {'dept': dept, 'floor': floor}

df = pd.DataFrame(frame)
df

   dept floor
0    CS     5
1   Bio     3
2  Chem     3
3   Phy     2
4   Eng     4

In [8]:
df.iloc[3]

dept     Phy
floor      2
Name: 3, dtype: object

In [9]:
df['floor'][0]

'5'

In [12]:
df[5]

KeyError: 5

## Part 1 Task 2

Practice with a data file.

(1) Choose one data file from the data folder in the given TW1 folder.

(2) Read the data into a DataFrame.

(3) Access the rows and columns.

(4) Drop some columns.

In [13]:
import pandas as pd
##reading the csv file
df= pd.read_csv("data/asthma.csv")

#this will show the first 5 rows , same as df.head(5)
df.head()

#show #of rows and columns
df.shape

#show columns name
df.columns

#show dataframe summary
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 180 entries, 0 to 179
Data columns (total 17 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   ID             180 non-null    object
 1   Date           180 non-null    object
 2   Temp_Mean      180 non-null    float64
 3   Humi_Mean      180 non-null    float64
 4   PM25_Mean_R    180 non-null    float64
 5   CO2_Mean       180 non-null    float64
 6   PEFR_Morning   180 non-null    int64
 7   PEFR_After     180 non-null    int64
 8   PEFR_Max       180 non-null    int64
 9   Birth          180 non-null    object
 10  Age            180 non-null    int64
 11  Gender         180 non-null    int64
 12  BMI            180 non-null    float64
 13  Income         180 non-null    int64
 14  Road_Distance  180 non-null    int64
 15  Cooking        180 non-null    int64
 16  Height         180 non-null    float64
dtypes: float64(6), int64(8), object(3)
memory usage: 24.0+ KB

In [14]:
#display first row after accessing it
df.iloc[0]

#display rows from 10-21
df.iloc[10:21]

,ID,Date,Temp_Mean,Humi_Mean,PM25_Mean_R,CO2_Mean,PEFR_Morning,PEFR_After,PEFR_Max,Birth,Age,Gender,BMI,Income,Road_Distance,Cooking,Height
10,SB-011,11/11/17,22.886111,44.782639,39.187500,1165.718056,280,320,320,3/23/53,66,1,21.34867,5,2,3,151.5
11,SB-011,11/12/17,23.808958,44.759722,32.402222,1402.948611,280,320,320,3/23/53,66,1,21.34867,5,2,3,151.5
12,SB-011,11/13/17,22.996528,43.554861,39.823958,1065.839583,280,320,320,3/23/53,66,1,21.34867,5,2,3,151.5
13,SB-011,11/14/17,23.625208,44.165278,37.333194,1237.721528,270,310,310,3/23/53,66,1,21.34867,5,2,3,151.5
14,SB-011,11/15/17,23.602569,42.831944,23.983819,1418.523611,280,310,310,3/23/53,66,1,21.34867,5,2,3,151.5
15,SB-011,11/16/17,23.336528,43.590278,22.199028,1574.438194,280,320,320,3/23/53,66,1,21.34867,5,2,3,151.5
16,SB-011,11/17/17,22.749167,40.613889,35.601667,1300.329861,270,310,310,3/23/53,66,1,21.34867,5,2,3,151.5
17,SB-011,11/18/17,22.849792,38.227778,40.269028,1231.178472,270,310,310,3/23/53,66,1,21.34867,5,2,3,151.5
18,SB-011,11/19/17,23.577361,37.750694,20.954097,1339.226389,270,320,320,3/23/53,66,1,21.34867,5,2,3,151.5
19,SB-011,11/20/17,22.364792,35.813194,37.754792,1196.786111,270,310,310,3/23/53,66,1,21.34867,5,2,3,151.5
20,SB-011,11/21/17,22.865069,40.290972,38.257639,1396.988194,280,320,320,3/23/53,66,1,21.34867,5,2,3,151.5

In [15]:
#Age column
df["Age"]

#Age, BMI, Height Column
df[["Age","BMI", "Height"]]

     Age       BMI  Height
0     66  21.34867   151.5
1     66  21.34867   151.5
2     66  21.34867   151.5
3     66  21.34867   151.5
4     66  21.34867   151.5
..   ...       ...     ...
175   66  21.34867   151.5
176   66  21.34867   151.5
177   66  21.34867   151.5
178   66  21.34867   151.5
179   66  21.34867   151.5

[180 rows x 3 columns]

In [32]:
#colomns from 0-5 using labels
df.loc[0:5,["Age","BMI","Height"]]

   Age       BMI  Height
0   66  21.34867   151.5
1   66  21.34867   151.5
2   66  21.34867   151.5
3   66  21.34867   151.5
4   66  21.34867   151.5
5   66  21.34867   151.5

In [33]:
#drop the coloums Birth, Date ID and give new Dataframe
drop= df.drop(columns=["Birth","Date","ID"])

#dispaly the new dataframe after drop
drop.head()

,Temp_Mean,Humi_Mean,PM25_Mean_R,CO2_Mean,PEFR_Morning,PEFR_After,PEFR_Max,Age,Gender,BMI,Income,Road_Distance,Cooking,Height
0,23.477778,50.243056,47.041667,904.877778,280,300,300,66,1,21.34867,5,2,3,151.5
1,23.401875,55.382639,40.629236,998.941667,270,300,300,66,1,21.34867,5,2,3,151.5
2,23.446111,53.793056,43.817847,996.820833,280,310,310,66,1,21.34867,5,2,3,151.5
3,23.305417,49.570139,54.553681,1230.109722,280,310,310,66,1,21.34867,5,2,3,151.5
4,22.997708,46.295139,41.140208,1297.323611,280,310,310,66,1,21.34867,5,2,3,151.5